Revit 2027 API
UIFabricationUtils.SetOpenConnectorIndicatorAwayColor Method
 Sets the color of the open connector indicator in away direction
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetOpenConnectorIndicatorAwayColor(
	Color color
)
Public Shared Sub SetOpenConnectorIndicatorAwayColor (
	color As Color
)
public:
static void SetOpenConnectorIndicatorAwayColor(
	Color^ color
)
static member SetOpenConnectorIndicatorAwayColor :
        color : Color -> unit
Parameters
color Color
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UIFabricationUtils Class
Autodesk.Revit.UI Namespace